// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// (НЕ ИСПОЛЬЗОВАТЬ НУМЕРАЦИЮ СТРОК И МАССИВЫ)

// 645 -> 5
// 78 -> третьей цифры нет
// 326791 -> 6

Console.WriteLine("Hello, World!");
